<?php
// 以下をfor文を使用して表示してください。
// ヒント: forの中でforを３回使用

// ********1
// *******121
// ******12321
// *****1234321
// ****123454321
// ***12345654321
// **1234567654321
// *123456787654321
// 12345678987654321

$input =9;


for($x=1; $x<=$input; $x++){
    for($y=$input; $y>$x; $y--){
        echo "*";
    }
    for($y=1; $y<=$x; $y++){
        echo $y;    
    }
    for($y=1; $y<$x ;$y++){
        echo $x-$y;
    }
    echo "<br/>";
}

//for($i=1; $i<=$input; $i++){
//    for($j=1; $j<=$i; $j++){
//        echo $j;    
//    }
//    echo "<br/>";
//}

//for($x=$input-1; $x>=0; $x--){
//    for($y=$input; $y>=$x+1 ;$y--){
//        echo $y-$x;
//    }
//    echo "<br/>";
//}



?>